; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v4)
		(pred_1 ?v2)
		(pred_6 ?v1)
		(pred_3 ?v1)
		(pred_4 ?v2 ?v1)
		(pred_2)
		(pred_5 ?v2))

   (:action op_1
       :parameters  (?v7 ?v6)
       :precondition (and (not-eq ?v7 ?v6) 
                          (pred_6 ?v7) (pred_6 ?v6) (pred_3 ?v7))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v7))))


   (:action op_3
       :parameters (?v3 ?v5)
       :precondition  (and  (pred_1 ?v3) (pred_6 ?v5)
			    (pred_4 ?v3 ?v5) (pred_3 ?v5) (pred_2))
       :effect (and (pred_5 ?v3)
		    (not (pred_4 ?v3 ?v5)) 
		    (not (pred_2))))

   (:action op_2
       :parameters  (?v3  ?v5)
       :precondition  (and  (pred_1 ?v3) (pred_6 ?v5)
			    (pred_5 ?v3) (pred_3 ?v5))
       :effect (and (pred_4 ?v3 ?v5)
		    (pred_2)
		    (not (pred_5 ?v3)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_07 obj_01 obj_08 obj_05 obj_03 
          obj_02 obj_04 obj_06 
)
(:init
(pred_6 obj_07)
(pred_6 obj_01)
(pred_6 obj_08)
(pred_6 obj_05)
(pred_6 obj_03)
(pred_1 obj_02)
(pred_1 obj_04)
(pred_1 obj_06)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(pred_2)
(pred_4 obj_02 obj_07)
(pred_4 obj_04 obj_08)
(pred_4 obj_06 obj_07)
(pred_3 obj_03)
)
(:goal
(and
(pred_4 obj_02 obj_07)
(pred_4 obj_04 obj_05)
(pred_4 obj_06 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_04 obj_05) (pred_3 obj_07))
    (sometime-before  (pred_4 obj_06 obj_03) (pred_3 obj_01))
  )
)
)

; plan
1. (op_1 obj_03 obj_08)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_08)
   goals met: 1 of 3
2. (op_3 obj_04 obj_08)
   deleted: (pred_4 obj_04 obj_08) (pred_2)
   added: (pred_5 obj_04)
   goals met: 1 of 3
3. (op_1 obj_08 obj_01)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_01)
   goals met: 1 of 3
4. (op_2 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_4 obj_04 obj_01) (pred_2)
   goals met: 1 of 3
5. (op_1 obj_01 obj_07)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_07)
   goals met: 1 of 3
6. (op_3 obj_06 obj_07)
   deleted: (pred_4 obj_06 obj_07) (pred_2)
   added: (pred_5 obj_06)
   goals met: 1 of 3
7. (op_1 obj_07 obj_03)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_03)
   goals met: 1 of 3
8. (op_2 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_4 obj_06 obj_03) (pred_2)
   goals met: 2 of 3
9. (op_1 obj_03 obj_01)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_01)
   goals met: 2 of 3
10. (op_3 obj_04 obj_01)
   deleted: (pred_4 obj_04 obj_01) (pred_2)
   added: (pred_5 obj_04)
   goals met: 2 of 3
11. (op_1 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 2 of 3
12. (op_2 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_4 obj_04 obj_05) (pred_2)
   goals met: 3 of 3
